export default {
  homePage: {
    title: "首页",
    itemOne: {
      title: "前端的专业技能",
      tips: "还在学习的路上~",
      item_1: {
        title: "HTML5",
        tips: "HTML，超文本标记语言,可用于描述网页文档的一种标记语言",
      },
      item_2: {
        title: "CSS3",
        tips: "CSS3可用于控制Web页面的外观",
      },
      item_3: {
        title: "JavaScript",
        tips: "JavaScript是一种脚本，一门编程语言，它可以在网页上实现复杂的功能",
      },
      item_4: {
        title: "Vue",
        tips: "Vue是一套用于构建用户界面的渐进式框架",
      },
      item_5: {
        title: "React",
        tips: "React是由Facebook开源的一个进行创建用户界面的一款JavaScript库",
      },
      item_6: {
        title: "Angular",
        tips: "Angular是一个客户端的JavaScript MVC框架，用于开发动态Web应用程序",
      },
      bottomTips: "还在学习的路上~",
    },
    itemTwo: {
      title: "我擅长的方向",
      tips: "还在学习的路上~",
      item_1: {
        title: "PC/手机端网站开发",
        detail: "熟悉使用前端技术对设计稿还原，并且能处理PC端、移动端的兼容问题",
      },
      item_2: {
        title: "后台管理系统开发",
        detail: "熟悉使用前端技术对后台管理系统从零搭建项目，并且能按照原型或UI还原产品",
      },
      item_3: {
        title: "小程序开发",
        detail: "熟悉使用前端技术对设计稿还原，并且能处理不同手机的兼容性，以及对接其它第三方库",
      },
    },
    itemThree: {
      title: "项目的展示",
      tips: "还在学习的路上~",
      tips_1: "微站项目",
      tips_2: "我的官网",
      tips_3: "君丰国际快递集运转运小程",
    },
    itemFour: {
      title: "项目的成果",
      tips: "还在学习的路上~",
      item_1: {
        title: "铁塔后台管理系统",
        tips: "中国铁塔后台管理是基于区块链技术为中国铁塔打造了转供电开票业务系区块链应用系统,主要提供铁塔业务部门处理链上转供电业务数据，包含业主管理、站址、场租、合同等数据上链、上链数据溯源及校验，上链发票业务跟踪等功能。",
      },
      item_2: {
        title: "（PC、手机）响应式官网",
        tips: "君丰是一家专门为海外华人的一种集运转运业务，解决海外华人无法想在国内一样享受购物的问题，该网站主要是面向国外展示。",
      },
      item_3: {
        title: "君丰小程序",
        tips: "君丰国际快递集运转运小程序主要是专业为海外华人、留学生、跨境电商卖佳等提供仓储、运输一站式物流服务的客服端。如今将原有的公众号功能转移到微信小程序进行重构，优化代码并提高交互效果，提高用户体验。",
      },
    },
    itemFive: {
      title: "励志语录",
      tips: "还在学习的路上~",
      item: {
        tips_1: "每个优秀的人，背后都有一段沉默的时光",
        tips_2: "今日的梦想，成了明朝的希望",
        tips_3: "给自己一些肯定，你比自己想象中要坚强",
      },
      detail: "150164xxxxx",
    },
  },
  aboutPage: {
    skills: {
      title: "我的技能",
      item: {
        0: "熟练使用HTML5+CSS3，并结合Scss/Less等预处理器进行设计稿还原",
        1: "熟练使用JavaScript/Typescript，并能运用ES6+高级语法进行高效开发",
        2: "熟悉使用Vue2/Vue3及周边库（Vue-router、Vuex、Pinia等）进行项目，并了解过其源码",
        3: "熟悉使用小程序开发，使用过Uniapp进行跨平台开发",
        4: "善于使用Element、Ant design、Vant UI库进行二次开发成业务组件",
        5: "能独立搭建脚手架，对前端工程化有一定程度的理解和实践",
        6: "使用过Webpack、Vite打包工具，并进行过相应的前端性能优化",
        7: "使用过Nuxt框架以及Vite SSR进行对网站服务端渲染，并且对项目有一定的实践",
        8: "经常使用Git版本控制工具，进行代码管理，及实现过自动化部署",
        9: "参与过React Native进行APP项目开发，能使用React的基本用法",
      },
    },
    experience: {
      title: "工作经验",
      item_1: {
        tips: "广东胜通和科技服务有限公司",
        1: "负责网站前端开发，实现产品页面与功能",
        2: "对完成的页面进行维护和对网站前端性能做出相对应的优化",
        3: "与后端开发人员紧密交流，对接完成相应的功能",
      },
      item_2: {
        tips: "广州君丰供应链服务有限公司",
        1: "负责公司PC端、移动网页端、和小程序项目的前端开发",
        2: "负责与UI协作实现页面及交互，与后端工程师完成前后端功能联调",
        3: "对上线的功能或项目出现的问题及时解决，及对用户体验进行优化",
      },
    },
  },
  //
  porjectPage: {
    title: "我做过的项目",
    list: {
      program_0: {
        title: "Beespal官网（PC/Mobile）",
        detail:
          "君丰是一家专门为海外华人的一种集运转运业务，解决海外华人无法想在国内一样享受购物的问题，该网站主要是面向国外展示。",
      },
      program_1: {
        title: "君丰国际快递集运转运（小程序）",
        detail:
          "君丰国际快递集运转运小程序主要是专业为海外华人、留学生、跨境电商卖佳等提供仓储、运输一站式物流服务的客服端。如今将原有的公众号功能转移到微信小程序进行重构，优化代码并提高交互效果，提高用户体验。",
      },
      program_2: {
        title: "可信采集系统+可视化大屏",
        detail:
          "通过采集终端设备数据、或系统对接、或数据导入的方式，把综合能源服务平台的智能运维、需求响应、能效管理场景数据上链，利用区块链不可篡改、可追溯等特性，实现数据可信采集、可信存储、可追溯等功能。",
      },
      program_3: {
        title: "中国铁塔后台管理系统+可视化大屏",
        detail:
          "中国铁塔后台管理是基于区块链技术为中国铁塔打造了转供电开票业务系区块链应用系统,主要提供铁塔业务部门处理链上转供电业务数据，包含业主管理、站址、场租、合同等数据上链、上链数据溯源及校验，上链发票业务跟踪等功能。",
      },
      program_4: {
        title: "供应链金融平台",
        detail:
          "供应链金融平台是一款记录金额凭证的应用，此系统主要从普通企业申请凭证、核心企业审核、普通企业拿着凭证的金额转让给其他企业或找机构融资，机构选择融资的企业并对其放款的流程来记录金额凭证。",
      },
      program_5: {
        title: "中睿APP后台管理",
        detail:
          "中睿APP后台管理系统是应用于公司内部管理系统，此系统主要为该公司提供资讯活动发布、公司产品资料在线收纳，与合作公司相关生态化的管理，并可在线管理归纳公司相关的资料文档，且划分了九种角色对该系统各个模块上传审核查看进行权限管理，保证公司相关活动及资料能够快速安全，清晰地进行管理及展示，在本系统发布的一些内容也会在手机客户端进行展示。",
      },
      program_6: {
        title: "微站（移动端网站）",
        detail:
          "专业为海外华人、留学生、跨境电商卖佳等提供仓储、运输一站式物流服务的客服端。此网站主要方便淘宝客户不用关注公众号，也可以享受寄往国外的功能。",
      },
      program_7: {
        title: "我的响应式网站",
        detail:
          "biboom的个人网站，随着技术的快速发展，为了锻造自己的学习新的技术从而诞生，该网站主要是面向用户展示我所做过的项目经验。",
      },
    },
  },
  // 菜单栏
  header: {
    title: "biboom官网",
    closed: "关闭",
    1: "首页",
    2: "方向",
    3: "项目",
    4: "关于我",
    5: "用户反馈",
    6: "常见问题",
  },
  //
  footer: {
    icp: "粤ICP备2022015421号",
    bi: "biboom 2022-z",
    top: "点击回顶部",
  },
};
